testCases/01_body_immersion_test_Case/E_create_impeller_nonConvex/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    x0
    {
        type            fixedValue;
        value           uniform 0;
    }
    x1
    {
        type            zeroGradient;
    }

    z0
    {
        type            zeroGradient;
    }

    z1
    {
        type            zeroGradient;
    }

    y1
    {
        type            fixedValue;
        value           uniform 0;
    }

    y0
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
